tutorials/testcases/advection/templates/simple/unstructured/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.6675 0 0);

boundaryField
{
    inlet
    {
        type            mapped;
        interpolationScheme cellPointFace;
        setAverage      true;
        average         (0.6675 0 0);
        value           $internalField;
    }

    fixedWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    ".*stream"
    {
        type            bellerophon;
        value           $internalField;
    }
}


// ************************************************************************* //
