tutorials/testcases/advection/templates/simple/unstructured/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
        inlet
        {
            type            mappedPatch;
            sampleMode      nearestCell;
            offset          (2.4 0 0);
        }
        fixedWalls
        {
            type            wall;
        }
        frontAndBack
        {
            type            empty;
        }
        upstream
        {
            type            bellerophon;
            donorZone       downstream;
        }
    }
}

// ************************************************************************* //
