tutorials/testcases/advection/templates/simple/unstructured/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    holeSource;
        type    cellSet;
        action  new;
        source  zoneToCell;
        sourceInfo
        {
            name downstream;
        }
    }

    {
        name    holeSource;
        type    cellSet;
        action  delete;
        source  boxToCell;
        sourceInfo
        {
            box (INTERFACE1 0 0) (999 1 0.1);
        }
    }
);

// ************************************************************************* //
