tutorials/testcases/advection/templates/simple/unstructured/system/topoSetDict.1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    upstream;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set  region0;
        }
    }

    {
        name    downstream;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set  region1;
        }
    }
);

// ************************************************************************* //
